# <p style="text-align:center;"><strong>Data Cleaning with Pandas</strong></p>

### import pandas

In [47]:
import pandas as pd

### Load dataset

In [48]:
df = pd.read_excel('dataset/Customer Call List.xlsx')
df.head()

,CustomerID,First_Name,Last_Name,Phone_Number,Address,Paying Customer,Do_Not_Contact,Not_Useful_Column
0,1001,Frodo,Baggins,123-545-5421,"123 Shire Lane, Shire",Yes,No,True
1,1002,Abed,Nadir,123/643/9775,93 West Main Street,No,Yes,False
2,1003,Walter,/White,7066950392,298 Drugs Driveway,N,NaN,True
3,1004,Dwight,Schrute,123-543-2345,"980 Paper Avenue, Pennsylvania, 18503",Yes,Y,True
4,1005,Jon,Snow,876|678|3469,123 Dragons Road,Y,No,True

### Basic Information of Dataset

In [49]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21 entries, 0 to 20
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   CustomerID         21 non-null     int64
 1   First_Name         21 non-null     object
 2   Last_Name          20 non-null     object
 3   Phone_Number       19 non-null     object
 4   Address            21 non-null     object
 5   Paying Customer    21 non-null     object
 6   Do_Not_Contact     17 non-null     object
 7   Not_Useful_Column  21 non-null     bool
dtypes: bool(1), int64(1), object(6)
memory usage: 1.3+ KB

In [50]:
df.shape

(21, 8)

## Data Cleaning Steps

#### 1. Remove useless columns

In [51]:
df.columns

Index(['CustomerID', 'First_Name', 'Last_Name', 'Phone_Number', 'Address',
       'Paying Customer', 'Do_Not_Contact', 'Not_Useful_Column'],
      dtype='object')

In [52]:
# remove not useful columns
df.drop(columns=['Not_Useful_Column'], inplace=True)

#### 2. Remove  duplicates

In [53]:
# explore duplicates rows
df[df['CustomerID'].duplicated() ==1]

,CustomerID,First_Name,Last_Name,Phone_Number,Address,Paying Customer,Do_Not_Contact
20,1020,Anakin,Skywalker,876|678|3469,"910 Tatooine Road, Tatooine",Yes,N

In [54]:
df[df['CustomerID'].isin([1020, 1021])]

,CustomerID,First_Name,Last_Name,Phone_Number,Address,Paying Customer,Do_Not_Contact
19,1020,Anakin,Skywalker,876|678|3469,"910 Tatooine Road, Tatooine",Yes,N
20,1020,Anakin,Skywalker,876|678|3469,"910 Tatooine Road, Tatooine",Yes,N

In [55]:
# drop duplicates row
df = df.drop_duplicates()

# Now check duplicates
df.duplicated().sum()

0

#### 3. Dealing with inconsistencies

In [56]:
# explore first column
df['CustomerID'].unique()

array([1001, 1002, 1003, 1004, 1005, 1006, 1007, 1008, 1009, 1010, 1011,
       1012, 1013, 1014, 1015, 1016, 1017, 1018, 1019, 1020], dtype=int64)

- There is no inconsistency in this column.

In [57]:
# explore second column
df['First_Name'].unique()

array(['Frodo', 'Abed', 'Walter', 'Dwight', 'Jon', 'Ron', 'Jeff',
       'Sherlock', 'Gandalf', 'Peter', 'Samwise', 'Harry', 'Don',
       'Leslie', 'Toby', 'Michael ', 'Clark', 'Creed', 'Anakin'],
      dtype=object)

- No inconsistency in this column.

In [58]:
# explore third column
df['Last_Name'].unique()

array(['Baggins', 'Nadir', '/White', 'Schrute', 'Snow', 'Swanson',
       '  Winger', 'Holmes', nan, 'Parker', 'Gamgee', '...Potter',
       'Draper', 'Knope', 'Flenderson_', 'Weasley', 'Scott', 'Kent',
       'Braton', 'Skywalker'], dtype=object)

- It has some inconsistency.
- Its values are with speatial characters and spaces

In [59]:
# delete inconsistencies in last name
# df['Last_Name'] = df['Last_Name'].str.strip( '/' )
# df['Last_Name'] = df['Last_Name'].str.strip( '_' )
# df['Last_Name'] = df['Last_Name'].str.strip( '...' )
# df['Last_Name'] = df['Last_Name'].str.strip( ' ' )
# method 2
df['Last_Name'] = df['Last_Name'].str.strip('123./_ ')


df['Last_Name'].unique()

array(['Baggins', 'Nadir', 'White', 'Schrute', 'Snow', 'Swanson',
       'Winger', 'Holmes', nan, 'Parker', 'Gamgee', 'Potter', 'Draper',
       'Knope', 'Flenderson', 'Weasley', 'Scott', 'Kent', 'Braton',
       'Skywalker'], dtype=object)

In [60]:
# explore fourth column
df['Phone_Number'].unique()

array(['123-545-5421', '123/643/9775', 7066950392, '123-543-2345',
       '876|678|3469', '304-762-2467', nan, 'N/a'], dtype=object)

- It has some inconsistency

In [75]:
# deal with inconsistencies in phone number
#df['Phone_Number'] = df['Phone_Number'].str.replace('[^a-zA-Z0-9]', '' , regex=True)
# convert to string
#df['Phone_Number'] = df['Phone_Number'].astype(str)
#df['Phone_Number'] = df['Phone_Number'].apply(lambda x: x[0:3] + '-' + x[3:6] + '-' + x[6:10])
# replace nan
#df['Phone_Number'] = df['Phone_Number'].str.replace('nan--' , '')
df['Phone_Number'] = df['Phone_Number'].str.replace('Na--' , '')

In [76]:
# explore five column
df['Address'].unique()

array(['123 Shire Lane, Shire', '93 West Main Street',
       '298 Drugs Driveway', '980 Paper Avenue, Pennsylvania, 18503',
       '123 Dragons Road', '768 City Parkway', '1209 South Street',
       '98 Clue Drive', '123 Middle Earth', '25th Main Street, New York',
       '612 Shire Lane, Shire', '2394 Hogwarts Avenue',
       '2039 Main Street', '343 City Parkway', '214 HR Avenue',
       '2395 Hogwarts Avenue', '121 Paper Avenue, Pennsylvania',
       '3498 Super Lane', 'N/a', '910 Tatooine Road, Tatooine'],
      dtype=object)

- There are many inconsistencies

In [82]:
# create new columns
df['Street_Adress'] = df['Address'].str.split(',').str[0]
df['State'] = df['Address'].str.split(',').str[1]
df['Zipcode'] = df['Address'].str.split(',').str[2]
df.head()

,CustomerID,First_Name,Last_Name,Phone_Number,Address,Paying Customer,Do_Not_Contact,Street_Adress,State,Zipcode
0,1001,Frodo,Baggins,123-545-5421,"123 Shire Lane, Shire",Yes,No,123 Shire Lane,Shire,NaN
1,1002,Abed,Nadir,123-643-9775,93 West Main Street,No,Yes,93 West Main Street,NaN,NaN
2,1003,Walter,White,,298 Drugs Driveway,N,NaN,298 Drugs Driveway,NaN,NaN
3,1004,Dwight,Schrute,123-543-2345,"980 Paper Avenue, Pennsylvania, 18503",Yes,Y,980 Paper Avenue,Pennsylvania,18503
4,1005,Jon,Snow,876-678-3469,123 Dragons Road,Y,No,123 Dragons Road,NaN,NaN

In [83]:
# lets explore six column
df['Paying Customer'].unique()

array(['Yes', 'No', 'N', 'Y', 'N/a'], dtype=object)

- Some Inconsistencies

In [84]:
# replace yes to Y
df['Paying Customer'] = df['Paying Customer'].str.replace('Yes' , 'Y')

# replace No to N
df['Paying Customer'] = df['Paying Customer'].str.replace('No' , 'N')

In [86]:
# explore seven column
df['Do_Not_Contact'].unique()

array(['No', 'Yes', nan, 'Y', 'N'], dtype=object)

In [87]:
# replace yes to Y
df['Do_Not_Contact'] = df['Paying Customer'].str.replace('Yes' , 'Y')

# replace No to N
df['Do_Not_Contact'] = df['Paying Customer'].str.replace('No' , 'N')

In [97]:
df.fillna("")
df

,CustomerID,First_Name,Last_Name,Phone_Number,Address,Paying Customer,Do_Not_Contact,Street_Adress,State,Zipcode
1,1002,Abed,Nadir,123-643-9775,93 West Main Street,N,N,93 West Main Street,NaN,NaN
2,1003,Walter,White,,298 Drugs Driveway,N,N,298 Drugs Driveway,NaN,NaN
6,1007,Jeff,Winger,,1209 South Street,N,N,1209 South Street,NaN,NaN
7,1008,Sherlock,Holmes,876-678-3469,98 Clue Drive,N,N,98 Clue Drive,NaN,NaN
14,1015,Toby,Flenderson,304-762-2467,214 HR Avenue,N,N,214 HR Avenue,NaN,NaN
15,1016,Ron,Weasley,123-545-5421,2395 Hogwarts Avenue,N,N,2395 Hogwarts Avenue,NaN,NaN
18,1019,Creed,Braton,,N/a,N/a,N/a,N/a,NaN,NaN